In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
dframe = DataFrame({'City':['birtamod','biratnagar','Damak','kathmandu'],
                   'altutude':[1121,4452,2214,4451]})
dframe

         City  altutude
0    birtamod      1121
1  biratnagar      4452
2       Damak      2214
3   kathmandu      4451

In [9]:
state_map = {'birtamod':'jhapa','biratnagar':'morang','Damak':'jhapa','kathmandu':'ktm'}

In [10]:
dframe['district'] = dframe['City'].map(state_map)

In [11]:
dframe

         City  altutude district
0    birtamod      1121    jhapa
1  biratnagar      4452   morang
2       Damak      2214    jhapa
3   kathmandu      4451      ktm